def insertion_sort(arr):
    """
    in-place сортировка O(N**2) в худшем случае.
    Идея: представим, что какая-то часть массива отсортирована (i), поэтому начинаем в цикле просматривать
    все элементы, начиная с первого индекса. Сравниваем, что j элемент больше j - 1.
    Если это не так, то меняем их местами. Проверяем в цикле while два условия. Пока индекс j > 0 и то, что
    j - 1 больше элемента j для их свапа.
    """
    len_arr = len(arr)
    for i in range(1, len_arr):
        temp = i
        while temp > 0 and arr[temp - 1] > arr[temp]:
            arr[temp], arr[temp - 1] = arr[temp - 1], arr[temp]
            temp -= 1
